In [1]:
import numpy as np
import pandas as pd
from datetime import datetime

In [3]:
df = pd.read_csv('data/filmrelease_raw.csv', sep=';', header=None)
df.dropna((0,1), how='all', inplace=True, thresh=2)
df.columns = ['Date', 'Film1', 'Film2', 'Film3', 'Film4', 'Film5']
df.head()

,Date,Film1,Film2,Film3,Film4,Film5
0,"Friday, January 9, 2015",Taken 3,NaN,NaN,NaN,NaN
4,"Friday, January 16, 2015",Blackhat,Paddington,The Wedding Ringer,NaN,NaN
14,"Friday, January 23, 2015",Mortdecai,Strange Magic,The Boy Next Door,NaN,NaN
24,"Friday, January 30, 2015",Black or White,Project Almanac,The Loft,NaN,NaN
34,"Friday, February 6, 2015",Jupiter Ascending,Seventh Son,SpongeBob Movie: Sponge Out of Water,NaN,NaN

In [4]:
df.loc[lambda x: x.index >= 716, 'Date'] += ', 2016'
df['Date'] = df['Date'].apply(lambda x: 
                              datetime.strptime(x, '%A, %B %d, %Y'))
df.head()

,Date,Film1,Film2,Film3,Film4,Film5
0,2015-01-09,Taken 3,NaN,NaN,NaN,NaN
4,2015-01-16,Blackhat,Paddington,The Wedding Ringer,NaN,NaN
14,2015-01-23,Mortdecai,Strange Magic,The Boy Next Door,NaN,NaN
24,2015-01-30,Black or White,Project Almanac,The Loft,NaN,NaN
34,2015-02-06,Jupiter Ascending,Seventh Son,SpongeBob Movie: Sponge Out of Water,NaN,NaN

In [6]:
# replace movie names with ones
df.iloc[:,1:] = df.iloc[:,1:].replace(r'\w', 1.0, regex=True)
df.head()

         Date  Film1  Film2  Film3  Film4  Film5
0  2015-01-09    1.0    NaN    NaN    NaN    NaN
4  2015-01-16    1.0    1.0    1.0    NaN    NaN
14 2015-01-23    1.0    1.0    1.0    NaN    NaN
24 2015-01-30    1.0    1.0    1.0    NaN    NaN
34 2015-02-06    1.0    1.0    1.0    NaN    NaN

In [7]:
df['film_sum'] =df[['Film1', 'Film2', 'Film3', 'Film4', 'Film5']].sum(axis=1)
df.drop(['Film1', 'Film2', 'Film3', 'Film4', 'Film5'], axis=1, inplace=True)
df.head()

         Date  film_sum
0  2015-01-09       1.0
4  2015-01-16       3.0
14 2015-01-23       3.0
24 2015-01-30       3.0
34 2015-02-06       3.0

In [190]:
df.to_csv('data/filmrelease.csv')